INSERT INTO public.profession (id, cover_url, description, name, short_description) VALUES (14, 'https://altcon.ru/uploaded/article/pic_53.jpg', 'Это человек, который сначала определяет, где находится бизнес клиента и где он должен быть (куда мы идем?). Затем вместе с заказчиком и командой прописывает маршрут, чтобы с минимальными затратами принести максимальную пользу бизнесу. Это если коротко.

Бизнес-аналитик нужен на всех трех этапах проекта.

1. Предпроектный анализ. Занимает, как правило, 2‒6 недель. Задача аналитика — выявить текущее состояние бизнеса, его потребности и определить границы решений: что делаем, а что делать не будем. Это верхнеуровневый анализ. Если, допустим, клиент внедряет ERP — аналитик определяет, какие модули нужны, с чем интегрируемся, какие будут типы пользователей.

Главная сложность на этом этапе — сформировать единое видение для заказчика и разработчика: куда идем, что делаем и что не делаем.

2. Анализ в рамках проекта. Может длиться полгода, год и больше. Бизнес-аналитик работает с детальными требованиями: выявляет, описывает, моделирует и согласовывает. Управляет запросами на изменения, если в процессе появились новые бизнес-задачи, поменялся закон, регулирующий деятельность клиента, появились или изменились пожелания заинтересованных лиц.

3. Постпроектный анализ. После релиза аналитик оценивает, насколько решение соответствует планам, что мешает приносить заявленную ценность, какие улучшения можно внести. Обновляет базу знаний по продукту, если планируется дальнейшее сопровождение/развитие системы или это предусмотрено контрактом.

С кем работает бизнес-аналитик?
Иногда говорят, что бизнес-аналитик — переводчик между бизнесом и IT. Я считаю, что это человек, который организовывает совместную работу. Это равноправный участник круглого стола, за которым сидят разработчики, тестировщики, менеджеры проекта, заказчик, его поставщики и клиенты, регулятор в лице отдела контроля качества, государства и международных организаций. Вот фактически с ними, так или иначе, работает бизнес-аналитик.
 
Чем отличается бизнес-аналитик в IT от других бизнес-аналитиков?
С высоты птичьего полета все бизнес-аналитики делают одно и то же. Они изучают работу организации заказчика и предлагают способы достижения бизнес-целей. Это можно сделать разными способами, например, с помощью перераспределения обязанностей в коллективе, изменения бизнес-процессов, вынесения каких-то работ на аутсорс. Т. е. не обязательно нужно разрабатывать новое ПО.

Отличие бизнес-аналитика в IT в том, что его главный инструмент для достижения целей — именно ПО. В его проекте требуется разработка, доработка или внедрение коробочного решения.

Как выглядит рабочий день бизнес-аналитика?
Основная часть рабочего времени уходит на общение с командой, чтобы донести требования заказчика, проговорить варианты реализации, ответить на имеющиеся и собрать новые вопросы. Во-вторых, общение с клиентом: выявление требований, фиксация договоренностей, определение приоритетов. В-третьих, бумажная работа: подготовка спецификаций, анализ документов, которые являются источниками требований.

Какие компетенции нужны бизнес-аналитику?
Вот что отличает хорошего бизнес-аналитика.

Широкий кругозор. Знание предметных областей, специфики разных видов деятельности позволяет быстрее погрузиться в проект и говорить с клиентом на одном языке. Плюс нужно держать в голове паттерны решения задач, которые можно переиспользовать в проектах.
Развитые коммуникативные навыки. Если вам тяжело общаться с людьми и доносить информацию в понятном виде, возможно, эта работа не для вас. Существует, правда, классификация, согласно которой есть бизнес-аналитики и системные аналитики. Считается, что первые больше общаются с людьми, а вторые работают с документами, и им можно быть нелюдимыми интровертами. На самом деле, такое разделение встречается редко. Во всяком случае, в крупных аутсорс-компаниях бизнес-аналитик и системный аналитик — одно и то же лицо.
Аналитический склад ума. На практике это означает, что аналитик умеет генерировать разные варианты решения задачи.', 'Аналитик', null);
INSERT INTO public.profession (id, cover_url, description, name, short_description) VALUES (15, 'https://proforientator.ru/upload/img/publications/stati/testirovshik1.jpg', 'IT-разработчик — специалист, который занимаемся созданием приложений для мобильных устройств и компьютеров, баз данных, игр и прочего программного обеспечения.
Вопреки распространенному мнению, программисты и IT-разработчики выполняют работу разных типов.
В упрощенном смысле можно сказать, что программисты выполняют поставленные перед ними задачи по готовому техзаданию. Они составляют алгоритмы.
Работа разработчиков более творческая, но при этом также построена на языках программирования. Разработчик - специалист, который занимаемся созданием приложений для мобильных устройств и компьютеров, баз данных, игр и прочего программного обеспечения. Для каждого проекта такой специалист разрабатывает концепцию и функции, его цель – разработка адаптированной программы для конкретного бизнеса и любого процесса с учетом всех его уникальных особенностей. Профессию разработчика можно разделить на несколько основных специальностей.

Веб-разработка
В 2022 году интернет насчитывает уже более 1.83 млрд сайтов, и это показывает, насколько важны веб-разработчики. В их обязанности входит создание сайтов и веб-сервисов, а также управление ими. Профессию можно разделить на несколько ветвей:

Front-end разработчики занимаются внешней оболочкой веб-ресурсов. Их главная задача — сделать так, чтобы посетителям сайта было комфортно на нем находится. Навыки дизайна играют при этом немаловажную роль.

Back-end разработчики занимаются технической частью сайта и его внутренним наполнением. Представители этой профессии должны обладать бОльшим количеством навыков по сравнению с front-end.

Full-stack специалисты одновременно выполняет обязанности и front-end, и back-end разработчиков. Стоит отметить, что компании, как правило, выбирают более узких специалистов. Практика показывает, что в этом случае результаты труда будут более качественными.

Разработчик игр
Возможностью проводить время в играх, сидя за компьютером или смартфоном, мы обязаны java-разработчикам. Они детально продумывают концепцию игры, создают код, внедряют в проект результаты своей работы, ищут возможные проблемы и при необходимости исправляют их. Они находятся в тесном контакте с гейм-дизайнерами, выражающими идеи в графическом формате.

Мобильный разработчик
Исследования показывают, что рынок мобильных приложений сейчас находится на подъеме. Количество скачиваний и покупок постоянно растет. Большая часть интернет-трафика приходится как раз на смартфоны и планшеты, поэтому востребованность мобильных разработчиков крайне высока.
К основным обязанностям таких специалистов относится создание приложений для мобильных устройств, работающих на Android и iOS. Они должны сделать программы прибыльными для своего работодателя и в то же время удобными для пользователей.

Разработчик баз данных
Ни одна из крупных компаний не может стабильно функционировать, если хранение данных в ней не структурировано и не систематизировано. Это и есть главная задача разработчиков баз данных. Они занимаются отладкой и модернизацией архивов. Выполнять такую работу невозможно, не изучив предварительно язык запросов SQL.', 'Разработчик', null);
INSERT INTO public.profession (id, cover_url, description, name, short_description) VALUES (16, 'https://adukar.by/images/photo/dizajner-arhiv.jpg', 'Дизайнер — специалист, разрабатывающий визуальную часть ИТ-продукта. Реализовать творческие способности можно в трёх направлениях: графический дизайн, веб-дизайн и гейм-дизайн. Принимать дизайнера за свободную, эксцентричную личность, творящую только в паре с музой, ошибочно. Он воплощает в жизнь требования клиента, оформленные в виде чётких указаний (ТЗ), отступить от которых значит получить на выходе иной результат, нежели хотел заказчик.
Дизайнер в ИТ обладает рядом профессиональных качеств. Креативность, эстетический вкус, коммуникабельность, организованность, ответственность, исполнительность, усидчивость, стремление к самосовершенствованию — это ценится в дизайнере в первую очередь. Работать он может как удалённо (контактирует только с заказчиком), так и в команде. Умение вести дискуссию, тактично доказывать свою точку зрения и адекватно воспринимать критику и пожелания — важная составляющая портрета профессионала.
 Профессиональный дизайнер в ИТ кроме хорошей художественной базы (знание живописи, техники рисунка, композиции, эргономики [науки о приспособлении предметов и объектов в широком смысле этого слова к особенностям человеческого организма — прим. ред.], цветовосприятия) на высоком уровне владеет графическими пакетами — Adobe Photoshop, Adobe Illustrator, Corel DRAW и т. д.

Графический дизайнер в ИТ-компании отвечает за её фирменный стиль (brand book). Он создаёт фирменный знак и логотип, выбирает цвета и гарнитуры шрифтов, разрабатывает макеты фирменной одежды для сотрудников и т. д. Веб-дизайнер отвечает за внешний вид (художественное оформление) и восприятие интернет-ресурса (интерфейс, логическая структура веб-страницы, размещение информации). Этот специалист подходит к созданию продукта со стороны требовательного пользователя.

Гейм-дизайнер создаёт стиль и механику игры. Отсюда внутренняя специализация на художников и программистов. Гейм-дизайнеры художники прорабатывают визуальный мир игры: создают концепт-арты персонажей, архитектуры (если таковая имеется), пейзажи — всё, что ты видишь. Вторые программируют события в игре, взаимодействие игрока с объектами, искусственный интеллект для персонажей и т. д. В этом деле кроме художественного вкуса понадобятся знания 3D-моделирования, физики и математики.', 'Дизайнер', null);
INSERT INTO public.profession (id, cover_url, description, name, short_description) VALUES (19, 'https://proforientator.ru/upload/img/publications/stati/testirovshik2.jpg', 'Если главная задача разработчика — создать продукт, то задача тестировщика — убедиться, что продукт работает именно так, как было задумано. При этом оба работают в тесном контакте друг с другом: тестировщик находит ошибки и уязвимости, передает их разработчику, тот вносит исправления — и продукт снова отправляют на тестирование. Так — пока не выпустят версию, которая не вызовет нареканий у тестировщика.

Вот как выглядит работа тестировщика:

Изучение документации по продукту: инструкции и рекомендации от разработчиков и продуктовых аналитиков.
Составление тест-кейсов для тестирования: какие функции нужно проверить и в какой последовательности, с учетом всех возможных сценариев поведения пользователя.
Тестирование.
Сбор и анализ полученных результатов: ошибки, сбои, некорректная работа, уязвимости.
Оформление полученных результатов в виде отчета с рекомендациями для разработчиков.
Тестирование проводят двумя способами:

Тестирование ПО и сервисов вручную —когда специалист сам проходит все этапы работы с продуктом. Для этого он тестирует его в разных операционных системах и браузерах, а также на разных устройствах. Это самый дорогой и долгий способ.
Автоматическое тестирование — с помощью автоматизированных инструментов. Подходит, когда есть готовый набор параметров для проверки, которые слишком долго перебирать вручную или же их применяют сразу для нескольких версий одного и того же продукта. Этот способ — более дешевый и быстрый, но все равно требует контроля со стороны тестировщика. Как правило, таким способом проверяют наиболее критичные функции — такие, как обработка платежей или защита персональных данных.
И ручное, и автоматическое тестирование может быть поведенческим или по методу «черного ящика». Вот личные качества, которые играют важную роль для этой профессии:

Аналитический склад ума. Вам придется работать с большими объемами информации, разрабатывать четкую последовательность действий и анализировать результаты.
Внимание к деталям. Тестировщик должен обращать внимание на малейшее отклонение от того, каким видят продукт разработчики и проверять любые возможные варианты.
Усидчивость. Приходится выполнять большой объем рутинных операций и тщательно следить за малейшими ошибками.
Критическое мышление. Даже если продукт выглядит идеальным, важно убедиться в этом на практике.
Ответственность и системный подход. Важно соблюдать регламенты и сценарии работы, добиваться поставленного результата и предоставлять итог своей работы в виде четких и понятных рекомендаций. Не просто найти ошибку, а подробно описать, при каких обстоятельствах и почему она возникает.
Эмпатия и внимание к людям. Это нужно, чтобы абстрагироваться от сугубо технических сценариев и инструкций и понять, как действует обычный человек, удобно ли ему будет работать с продуктом, с какими сложностями он столкнется.
Навыки коммуникации. Нужно уметь общаться и убеждать разработчиков и других участников команды в вашей правоте и необходимости внести правки.
Стремление к саморазвитию. В профессии тестировщика важно постоянно осваивать новые методы и технические приемы, чтобы хорошо разбираться в продукте, его слабых и сильных сторонах.
Интерфейс одного из сервисов для тестирования

Технические навыки и инструменты, которыми должен владеть тестировщик:

Основы программирования и редакторов кода: VScode, Pytest, Gitlab, XML, CSS, JavaScript.
Знание ключевых систем управления проектами в разработке — Waterfall, Scrum и Kanban.
Представление о том, как создаются пользовательские интерфейсы — в плане разработки, UX UI-дизайна.
Работа с системами баг-трекинга (обнаружения ошибок): Redmine, Jira.
Знание инструментов мониторинга HTTP/HTTPS-трафика.
Навыки работы с базами данных — такими, как MySQL, PostgreSQL, MS SQL.
Навыки составления тест-планов и тест-кейсов с помощью TestRail, Zephyr, TestLink и других сервисов.
Знание особенностей всех популярных ОС и браузеров — мобильных и десктопных.
Представление о клиент-серверной архитектуре.
Умение работать с системами контроля версий — например, CVS или Git.', 'Тестировщик', null);
INSERT INTO public.profession (id, cover_url, description, name, short_description) VALUES (20, 'https://proforientator.ru/upload/img/publications/stati/testirovshik3.jpg', 'Системный администратор (он же IT-администратор, сисадмин) – это специалист, который обеспечивает штатную работу парка компьютерной техники в компании или организации, правильную работу компьютерной сети и имеющегося программного обеспечения, а также отвечает за информационную безопасность организации. В связи с активной компьютеризацией всех коммерческих компаний и государственных учреждений, профессия системного администратора сейчас очень востребована на рынке труда. Должность системного администратора присутствует практически во всех фирмах и учреждениях, где используются большое количество компьютеров и сетевые ресурсы глобальной сети Интернет.

Обязанности системного администратора:
- установка и обслуживание компьютерной и офисной техники, оргтехники, внутренней АТС;
обеспечение безошибочной работы системного программного обеспечения (ОС Windows, Linux, Windows Server);
- обеспечение работоспособности и безопасности сети компании;
- установка, настройка и обновление офисного и прикладного программного обеспечения (MS Office, 1С и др.);
- обеспечение резервного копирования и восстановления данных;
- техническая поддержка и помощь пользователям, а также закупка компьютерной и офисной техники, необходимого программного обеспечения.
По квалификационному уровню, администратор должен осуществлять следующие виды деятельности:
- выполнение работ по проектированию сетевой инфраструктуры;
- организация сетевого администрирования;
- эксплуатация объектов сетевой инфраструктуры;
- управление сетевыми сервисами;
- сопровождение модернизации сетевой инфраструктуры.
и, кроме того, должен знать:
- знания и опыт в области сетевых технологий и системного администрирования с использованием учебных материалов компании CISCO;
- опыт установки и поддержки ОС Windows (различных версий);
- опыт установки и поддержки серверного программного обеспечения;
- знание распространенного программного обеспечения (MS Office, 1С и иных программ);
- знание принципов работы сетевых протоколов, принципов построения компьютерных сетей;
- знание аппаратной части РС и возможность диагностики и устранения неполадок;
- опыт работы с удаленными пользователями.', 'Администратор', null);
